# BeginMultipleDuplicate

## Description
Use this function in conjunction with EndMultipleDuplicate to preserve constraints on multiple duplicated objects.

```pascal
PROCEDURE BeginMultipleDuplicate;
```

```python

def vs.BeginMultipleDuplicate():
    return None
```

## See Also
VS Functions:
EndMultipleDuplicate

## Version
Availability: from Vectorworks 2011
## Category
* Object Editing